#include <stdio.h>
#include "Welcome.h"

void Welcome() {
    // הדפסת נגר+שמיים עם זיקוקים ב ACHII ART
    printf("      *    .     .  *       *  .     *  .   .  *     \\ | / \n");
    printf("  *       *   *   *      *         *       *     *   -- O --\n");
    printf("      *  \\ | /   *    *   .  * *   .  *   .  *    .  / | \\\n");
    printf("   .   * -- O --  *       *     *        *  *     *        *\n");
    printf("      *   / | \\  *    *       *  .    *  .      *  .    *  \n");
    printf(" *      *       *    .      *       *       *       *       \n");
    printf("* * *    ███╗   ██╗ █████╗  ██████╗  █████╗ ██████╗    * * *\n");
    printf("*   *    ████╗  ██║██╔══██╗██╔════╝ ██╔══██╗██╔══██╗| /     \n");
    printf("  *      ██╔██╗ ██║███████║██║  ███╗███████║██████╔╝O --*   \n");
    printf("*   *    ██║╚██╗██║██╔══██║██║   ██║██╔══██║██╔══██╗| \\    \n");
    printf("  * *    ██║ ╚████║██║  ██║╚██████╔╝██║  ██║██║  ██║   * *  \n");
    printf("* *      ╚═╝  ╚═══╝╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝ *   * *\n");
    printf("      *    .     .  *       *  .     *  .   *  .     *  .  *\n");
    printf("  *       *   *   *      *         *        *         *    .\n");
    printf("      *  \\ | /   *    *   .  *   .     *   .  *   .  *    *\n");
    printf("   .   * -- O --  *       *     *    *    *\\ | / *    *    \n");
    printf("      *   / | \\  *    *       *  .     *  -- O --.    *  . \n");
    printf(" *      *       *    .      *       *       / | \\   *     *\n");
    printf("/ / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / \n");
    printf("/ / / / / / / / / / / / / / / / / /myShell-ל םיאבה םיכורב/ / /\n");
    printf("/ / / / / / / / / / / / / / / / / / / / / /1.0.0-הסרג  / / / /\n");
    printf("/ / / / / / / / / / / / / / / / /https://github.com/omern100/ \n");
    printf("/ / / / / / / / / / / / / / / / / / / / /!ונהת / / / / / / /  \n");
    printf("I’ve already started dividing my life/ / / / / / / / / / / / /\n");
    printf(" into 4-byte blocks./ / / / / / / / / / / / / / / / / / / / / \n");
    printf(" -- O. Nagar/ / / / / / / / / / / / / / / / / / / / / / / / / \n");
    printf("/ / / / / / / / / / / / / / / / / / / / / / / / / / / / / / / \n\n");

}
